In [1]:
import pandas as pd

In [2]:
price = pd.read_csv('Reviewed Price Sheet - Yam.csv')

In [3]:
price = price.drop('AVERAGE', axis=1)

In [4]:
price.head()

,Year,JANUARY,FEBRUARY,MARCH,APRIL,MAY,JUNE,JULY,AUGUST,SEPTEMBER,OCTOBER,NOVEMBER,DECEMBER
0,YAM (KG),250.0000,250.0000,250.0000,250.0000,250.0000,250.0000,250.0000,250.0000,250.0000,250.0000,250.0000,250.0000
1,1970,0.0032,0.0031,0.0035,0.0037,0.0040,0.0039,0.0036,0.0037,0.0031,0.0030,0.0033,0.0035
2,1971,0.0037,0.0039,0.0040,0.0034,0.0051,0.0054,0.0039,0.0034,0.0030,0.0030,0.0034,0.0042
3,1972,0.0038,0.0044,0.0045,0.0051,0.0061,0.0065,0.0041,0.0035,0.0031,0.0035,0.0041,0.0044
4,1973,0.0045,0.0053,0.0057,0.0060,0.0067,0.0067,0.0055,0.0047,0.0043,0.0042,0.0054,0.0063

In [5]:
item_kg  = price.loc[0]

In [6]:
item_kg.head()

Year        YAM (KG)
JANUARY          250
FEBRUARY         250
MARCH            250
APRIL            250
Name: 0, dtype: object

In [7]:
price = price.drop(0)

In [8]:
price.columns = price.columns.str.strip()

In [9]:
price = pd.melt(price, id_vars=["Year"], 
                  var_name="MONTH", value_name="PRICE")

In [10]:
price.head()

   Year    MONTH   PRICE
0  1970  JANUARY  0.0032
1  1971  JANUARY  0.0037
2  1972  JANUARY  0.0038
3  1973  JANUARY  0.0045
4  1974  JANUARY  0.0068

In [11]:
price.to_csv('./cleaned/Yam-price.csv')